{
    "español":
    {
        "titlePageCatalog":"Mis mejores proyectos",
        "BestprojectsTypePokedex":"Crud",
        "BestprojectsTypeCriptos":"Cotizador",
        "BestprojectsTypeRes":"Restaurantes",
        "BestprojectsTypeBebidas":"Bebidas",
        "BestprojectsTitulePokedex":"Pokedex",
        "BestprojectsTituleCriptos":"Criptomonedas al instante",
        "BestprojectsTituleRes":"Restaurante crud",
        "BestprojectsTituleBebidas":"Recetas de bebidas",
        "BestprojectsContentPokedex":"En este proyecto, se obtienen todos los pokemones de la región de kanto, en el cual se puede pueden visualizar todos los resultados en una tabla inteligente donde podemos modificar la cantidad de resultados que queremos ver, además vamos a poder obtener todos los detalles de cada Pokémon y modificarle los valores de su peso y altura.",
        "BestprojectsContentCriptos":"Gracias a esta aplicación vamos a poder consultar la cotización de diferentes criptomonedas en el instante, además de esto al momento de darnos la cotización también nos dará el precio más alto del día y el más bajo también y cuando fue la última actualización de la cotización.",
        "BestprojectsContentRes":"En esta aplicación web vamos a poder realizar todas las funciones de un CRUD (Crear, Leer, Actualizar y Borrar) tradicional. En el mismo vamos a gestionar productos o platos de un restaurante. Además, como valor agregado, la aplicación cuenta con ciertas validaciones para generar productos o platos y actualiza el stock en el instante.",
        "BestprojectsContentBebidas":"Con esta útil aplicación web que utiliza SAS (software as service) usted podrá hacer búsquedas de bebidas tanto por nombre como por categoría. En la misma podrá visualizar los resultados y podrá acceder a un apartado en una pantalla modal donde encontrará la preparación y los ingredientes en una lista desordenada.",
        "BestprojectsBtnView":"Visitar la aplicacion",
        "titlePageContacto":"Conocimiento tecnico",
        "btnOrderAsc":"Ordenar acendentemente",
        "btnOrderDes":"Ordenar descendentemente",
        "subTitlePageContct":"Contacto",
        "textTitlePageContct":"Deja aquí tu consulta o su feedback!",
        "fieldContactName":"Tu nombre (opcional)",
        "fieldContactEmail":"Tu email",
        "fieldContactType":"Asunto (opcional)",
        "fieldContactMesagge":"Tu mensaje",
        "btnSendContact":"Enviar",
        "titleHome":"Inicio",
        "titleCatalogo":"Catalogo",
        "titleContacto":"Contacto",
        "name":"Franco Sosa",
        "position":"Sr full stack developer",
        "btnCatalogo":"Catalogo",
        "btnContacto":"Contacto",
        "titleAcademy":"En lo académico",
        "bodyAcademy":"Mi nombre es Franco Damián González Sosa, terminé la secundaria técnica en el 2016, me recibí de Técnico Superior en Informática. Luego de eso, me dedique a aprender desarrollo web. Hice bastantes cursos y al mismo tiempo ingresé a Ingeniería en Informática en la UNLAM (Universidad Nacional de la Matanza), donde cursé dos años. Actualmente estudio Analista de Sistemas en el mismo instituto que realice mi secundaria, en el Instituto Superior San Judas Tadeo. Estoy en mi segundo año de carrera, tengo planeado continuar mis estudios en Ingeniería de Sistemas en la UAI (Universidad Abierta Interamericana). En mi linkedin tengo todas mis certificaciones y más detalles de mi formación académica.",
        "titleWork":"En lo laboral",
        "titleExperiencie17":"Mi experiencia con 17 años",
        "bodyExperiencie17":"Comencé mi vida laboral como desarrollador a los 17 años. Con algunos compañeros de la secundaria generábamos proyectos con lógicas chicas y vistas sencillas, Tuvimos varios proyectos de .net y otros de wordpres que requerían conocimientos de html y javascript.",
        "titleExperiencie19":"Mi experiencia con 19 años",
        "bodyExperiencie19":"En mi último año de secundaria tuve una pasantía con algunos de mis compañeros. En esta teníamos que desarrollar un sistema que tuviera alguna función y que satisfaga alguna necesidad. Desarrollamos un sistema de escritorio hecho con c# cuya función principal era comunicar, lo nombramos “Holograma”, además de la aplicación que desarrollamos, también tuvimos que generar un soporte para el monitor y como parte esencial teníamos una pirámide de acrílico que también tuvimos que fabricar. Teníamos como objetivo usar APIs de Skype para poder hacer una videollamada con hologramas. ¡Sí sí, como en Star Wars!",
        "titleExperiencie20":"Mi experiencia con 20 años",
        "bodyExperiencie20":"A mis 20 años entré a mi primer Software Factory. Trabajé con Python y vistas en xml por que usaban un sistema conocido como crm que requería de dichas tecnologías. Fue mi primer acercamiento en Python, utilización de crm, hacer mis pruebas unitarias y cómo es el día a día en una consultora.",
        "titleExperiencie21":"Mi experiencia con 21 años",
        "bodyExperiencie21":"Un año más tarde, entré en la capacitación de .net en Accenture que es donde actualmente trabajo, desde mi comienzo en Accenture estoy trabajando con el cliente, Banco Galicia, aprendiendo desde asp.net core hasta react para las vistas. Estoy en la mesa de “consumo y pago mis tarjetas” donde se lleva a cabo desarrollos de pequeña a gran escala y realizamos migraciones de código para pasar a diferentes tecnologías.",
        "btnVideo":"Video de muestra",
        "TitleCertification":"Mis certificaciones",
        "contentCertificationsDateTextStart":"Obtenida el: ",
        "contentCertificationsDateTextNeverEnd":"Sin fecha de vencimiento",
        "contentCertificationsDateTextEnd":"vence el: ",
        "btnViewCertification":"Certificacion",
        "certificaitonNet1":"Introducción al Paradigma de Objetos",
        "bodyCertificaitonNet1":"EducacionIT",
        "certificaitonHolograma":"Holograma",
        "bodyCertificaitonHolograma":"Instituto Tecnico Industrial 'San Judas Tadeo'",
        "certificaitonSecundaria":"Bachiller en bienes y servicios",
        "bodyCertificaitonSecundaria":"Instituto Tecnico Industrial 'San Judas Tadeo'",
        "certificaitonJs1":"Javascript Desarrollador Avanzado Front-End",
        "bodyCertificaitonJs1":"EducacionIT",
        "certificaitonSql1":"Fundamentos de Programación con SQL Server 2017",
        "bodyCertificaitonSql1":"EducacionIT",
        "certificaitonSql2":"SQL Consultas en Micrsoft SQL server certificacion 70-61",
        "bodyCertificaitonSql2":"Udemy",
        "certificaitonHtml1":"HTML5: Fundamentos Web",
        "bodyCertificaitonHtml1":"EducacionIT",
        "certificaitonNet2":"Introducción a la Programación con C# .NET",
        "bodyCertificaitonNet2":"EducacionIT",
        "certificaitonHtml2":"Introducción a la Programación con C# .NET",
        "bodyCertificaitonHtml2":"EducacionIT",
        "certificaitonReact1":"Reactjs",
        "bodyCertificaitonReact1":"EducacionIT",
        "certificaitonReact2":"React - La Guía Completa: Hooks Context Redux MERN +15 Apps",
        "bodyCertificaitonReact2":"",
        "certificaitonGoogle":"Google Analytics para Principiantes",
        "bodyCertificaitonGoogle":"Google Analytics Academy",
        "certificaitonUTN":"Diseño web",
        "bodyCertificaitonUTN":"Universidad Tecnológica Nacional",
        "certificaitonCertiprof":"CertiProf",
        "bodyCertificaitonCertiprof":"Scrum Foundation Professional Certificate",
        "footerTitleDescription": "Descripcion",
        "footerBodyDescription" : "Soy un entusiasta de la tecnología que está en constante aprendizaje y conocimiento",
        "footerTitleStackTecnologico": "Stack Tecnico",
        "footerTitleFortaleza": "Fortaleza",
        "footerBodyFortaleza1": "Implementacion de buenas practicas",
        "footerBodyFortaleza2": "Reparacion de sistemas informáticos",
        "footerBodyFortaleza3": "Manejo y utilizacion de servidores",
        "footerBodyFortaleza4": "Comodidad desarrollando back end y front end",
        "footerBodyFortaleza5": "Exelente solución de problemas técnicos.",
        "footerTitleContacto": "Contacto",
        "projects": 
        [
            { 
                "projectTitle":"Buscador de clientes",
                "projectSubTitleUsser":"Descripción para el usuario",
                "projectSubTitleTec":"Descripción de la tecnologia",
                "projectDescripUsuario":"En esta aplicación se puede utilizar un buscador avanzado en el cual podemos realizar búsquedas generales de clientes, o podemos buscar por tipo de información sea nombre, direccion,email. tambien podemos filtrar por clientes chequeados.",
                "projectDescripTec":"Podemos realizar búsquedas por de clientes utilizando algoritmos de búsqueda y podemos agrupar filtros de búsqueda para encontrar el cliente buscado"
            },
            {
                "projectTitle":"Triviador",
                "projectSubTitleUsser":"Descripción para el usuario",
                "projectSubTitleTec":"Descripción de la tecnologia",
                "projectDescripUsuario":"en esta aplicación web el usuario puede registrar su nombre y elegir un género de trivias para responder diez preguntas de multiple choice. Obtendrá su puntaje y cuando tiempo demoro en hacer la trivia. Al finalizar la podrá acceder a una tabla con el top 10 de mejores puntajes.",
                "projectDescripTec":"en esta aplicación web que utiliza firebase pude gestionar registros de usuarios con información dada de alta en la aplicación. Los usuarios pueden ingresar con su nombre y obtener trivias y géneros aleatorios de un banco de datos. Esta aplicación está construida con EcmaScript almacena el puntaje y la duración  que el usuario tuvo al finalizar la trivia del género que eligió."
            },
            {
                "projectTitle":"Clima react",
                "projectSubTitleUsser":"Descripción para el usuario",
                "projectSubTitleTec":"Descripción de la tecnologia",
                "projectDescripUsuario":"Cargando la información al formulario, mostrará el clima de la zona elegida mostrando el resultado de una manera amigable para el usuario.",
                "projectDescripTec":"Consulta una api de climas, guarda la información en el state y lo muestra en un componente parametrizable por la respuesta de la api."
            },
            {
                "projectTitle":"Found Image",
                "projectSubTitleUsser":"Descripción para el usuario",
                "projectSubTitleTec":"Descripción de la tecnologia",
                "projectDescripUsuario":"El usuario podrá ver productos y acceder a su descripción, también podrá hacer búsquedas acerca de este producto de manera protegida ya que si no, el contenido de la página los productos y el buscador se ocultan y no puede ser accesibles.",
                "projectDescripTec":"En este proyecto se utiliza JWT (json web token) que permite validar la “sesión” del usuario para mostrar o no el contenido."
            },
            {
                "projectTitle":"Store Front-end",
                "projectSubTitleUsser":"Descripción para el usuario",
                "projectSubTitleTec":"Descripción de la tecnologia",
                "projectDescripUsuario":"El usuario podrá ver productos y acceder a su descripción, también podrá hacer búsquedas acerca de este producto de manera protegida ya que si no, el contenido de la página los productos y el buscador se ocultan y no puede ser accesibles.",
                "projectDescripTec":"En este proyecto se utiliza JWT (json web token) que permite validar la “sesión” del usuario para mostrar o no el contenido."
            },
            {
                "projectTitle":"Generador de turnos de veterinario",
                "projectSubTitleUsser":"Descripción para el usuario",
                "projectSubTitleTec":"Descripción de la tecnologia",
                "projectDescripUsuario":"El usuario puede generar turnos para una veterinaria y si ocurre el caso de que la aplicación se cierra involuntariamente persistirá la información. El usuario tiene la opción de eliminar el turno definitivamente.",
                "projectDescripTec":"Con ayuda del state de react y hooks con props se obtuvo esta aplicación web que guarda información de un formulario para registrar turnos de una veterinaria, si se actualiza o se cierra la página esto se guarda en cache y cuando vuelva a ingresar, se podrá acceder nuevamente a la información."
        
            },
            {
                "projectTitle":"Reproductor de playlist",
                "projectSubTitleUsser":"Descripción para el usuario",
                "projectSubTitleTec":"Descripción de la tecnologia",
                "projectDescripUsuario":"El usuario puede utilizar el proyecto para reproducir cinco canciones diferentes tanto de la lista como desde el reproudctor.",
                "projectDescripTec":"En este proyecto, tenemos un reproductor de un list de canciones, a travez de eventos podemos seleccionar diferentes canciones dentro de la playlist."
         
            },
            {
                "projectTitle":"Fraces populares",
                "projectSubTitleUsser":"Descripción para el usuario",
                "projectSubTitleTec":"Descripción de la tecnologia",
                "projectDescripUsuario":"Para los fanáticos de Breaking bad en esta aplicación web, se van mostrando frases de diversos personajes. Y sólo con apretar un botón, se obtiene una nueva frase",
                "projectDescripTec":"Con un api, un timer y un refresh logramos poder hacer una aplicación web en la que a los 10-15 segundos se actualiza la frase a través de una animación."
         
            },
            {
                "projectTitle":"Reserva de envios",
                "projectSubTitleUsser":"Descripción para el usuario",
                "projectSubTitleTec":"Descripción de la tecnologia",
                "projectDescripUsuario":"Podemos gestionar reservas en distintos horarios y tenemos la opción de cancelar o dar de alta una reserva.",
                "projectDescripTec":"Dentro de la aplicación creamos los horarios a cada 30 minutos y después utilizando vectores de tipo pila vamos agotando las reservas."
         
            },
            {
                "projectTitle":"Buscador de letras de canciones",
                "projectSubTitleUsser":"Descripción para el usuario",
                "projectSubTitleTec":"Descripción de la tecnologia",
                "projectDescripUsuario":"El usuario completando el formulario podrá acceder a una sección oculta de la página con el resultado de la búsqueda que hizo.",
                "projectDescripTec":"Descripción de la tecnologia Utiliza dos apis una para consultar la letra y otra que es un buscador de imágenes que se le atribuyen dos valores: el de artista y el de la canción entonces otorga una imagen del artista y la letra de la canción buscada."
            },
            {
                "projectTitle":"Transformador de palabras en CamelCase",
                "projectSubTitleUsser":"Descripción para el usuario",
                "projectSubTitleTec":"Descripción de la tecnologia",
                "projectDescripUsuario":"El usuario podrá cargar palabras u oraciones y convertirlas a CamelCase.",
                "projectDescripTec":"Con la tecnología de hock y métodos propios de javascrpit pude filtrar los espacios del string ingresado y pasar a mayúscula el carácter siguiente al espacio en blanco."
            },
            {
                "projectTitle":"Presupuestador automático",
                "projectSubTitleUsser":"Descripción para el usuario",
                "projectSubTitleTec":"Descripción de la tecnologia",
                "projectDescripUsuario":"Con la tecnología de hock y métodos propios de javascrpit pude filtrar los espacios del string ingresado y pasar a mayúscula el carácter siguiente al espacio en blanco.",
                "projectDescripTec":"Se define un valor del presupuesto total que se guarda en el state. Luego con nuevos valores, que cargados por el usuario, se restan del presupuesto total y genera una lista de los gastos. En el caso de superar el presupuesto total la aplicación web lo informará por debajo del presupuesto restante."
               
            }
        ]

    },
    "english":
    { 
        "titlePageCatalog":"My best projects",
        "BestprojectsTypePokedex":"Crud",
        "BestprojectsTypeCriptos":"quote",
        "BestprojectsTypeRes":"Restaurants",
        "BestprojectsTypeBebidas":"Drinks",
        "BestprojectsTitulePokedex":"Pokedex",
        "BestprojectsTituleCriptos":"Instant Crypto",
        "BestprojectsTituleRes":"Crud restaurant",
        "BestprojectsTituleBebidas":"drink recipes",
        "BestprojectsContentPokedex":"In this project, all the pokemons of the kanto region are obtained, in which you can view all the results in an intelligent table where we can modify the number of results that we want to see, we will also be able to obtain all the details of each Pokémon and modify the values of its weight and height.",
        "BestprojectsContentCriptos":"Thanks to this application we will be able to consult the price of different cryptocurrencies instantly, in addition to this at the time of giving us the price it will also give us the highest price of the day and the lowest as well and when the price was last updated.",
        "BestprojectsContentRes":"In this web application we will be able to perform all the functions of a traditional CRUD (Create, Read, Update and Delete). In it we will manage products or dishes from a restaurant. In addition, as an added value, the application has certain validations to generate products or dishes and updates the stock instantly.",
        "BestprojectsContentBebidas":"With this useful web application that uses SAS (software as service) you will be able to search for drinks both by name and by category. In it you will be able to view the results and you will be able to access a section in a modal screen where you will find the preparation and the ingredients in an unordered list.",
        "BestprojectsBtnView":"Visit the application",
        "titlePageContacto":"technical knowledge",
        "btnOrderAsc":"sort ascending",
        "btnOrderDes":"sort descending",
        "subTitlePageContct":"Contactc",
        "textTitlePageContct":"Leave your question or feedback here!",
        "fieldContactName":"Your name (optional)",
        "fieldContactEmail":"Your email",
        "fieldContactType":"Subject (optional)",
        "fieldContactMesagge":"Your message",
        "btnSendContact":"Send",
        "titleHome":"Home",
        "titleCatalogo":"Catalogue",
        "titleContacto":"Contactc",
        "name":"Franco Sosa",
        "position":"Sr full stack developer",
        "btnCatalogo":"Catalogue",
        "btnContacto":"Contactc",
        "titleAcademy":"in academics",
        "bodyAcademy":"My name is Franco Damián González Sosa, I finished technical high school in 2016, I received a Higher Technician in Computer Science. After that, I dedicated myself to learning web development. I took many courses and at the same time I entered Computer Engineering at UNLAM (National University of La Matanza), where I studied for two years. I am currently studying Systems Analyst at the same institute that I did my high school, at the Instituto Superior San Judas Tadeo. I am in my second year of college, I plan to continue my studies in Systems Engineering at the UAI (Universidad Abierta Interamericana). In my linkedin I have all my certifications and more details of my academic training.",
        "titleWork":"at work",
        "titleExperiencie17":"My experience with 17 years",
        "bodyExperiencie17":"I started my working life as a developer at the age of 17. With some high school classmates we generated projects with small logic and simple views. We had several .net and other wordpress projects that required knowledge of html and javascript.",
        "titleExperiencie19":"My experience with 19 years",
        "bodyExperiencie19":"In my last year of high school I had an internship with some of my classmates. In this we had to develop a system that had some function and that satisfies some need. We developed a desktop system made with C# whose main function was to communicate, we named it 'Hologram', in addition to the application we developed, we also had to generate a support for the monitor and as an essential part we had an acrylic pyramid that we also had to manufacture . Our goal was to use Skype APIs to be able to make a video call with holograms. Yes yes, like in Star Wars!",
        "titleExperiencie20":"Mi experiencia con 20 años",
        "bodyExperiencie20":"At the age of 20 I entered my first Software Factory. I worked with Python and views in xml because they used a system known as crm that required these technologies. It was my first approach in Python, using crm, doing my unit tests and how is the day to day in a consultancy.",
        "titleExperiencie21":"Mi experiencia con 21 años",
        "bodyExperiencie21":"A year later, I entered .net training at Accenture which is where I currently work, since my start at Accenture I have been working with the client, Banco Galicia, learning from asp.net core to react for views. I'm at the 'consumo y pago mi cards' table where developments are carried out from small to large scale and we carry out code migrations to move to different technologies.",
        "btnVideo":"sample video",
        "TitleCertification":"my certifications",
        "contentCertificationsDateTextStart":"Obtained on:",
        "contentCertificationsDateTextNeverEnd":"no expiration date",
        "contentCertificationsDateTextEnd":"expires on:",
        "btnViewCertification":"Certification",
        "certificaitonNet1":"Introduction to the Object Paradigm",
        "bodyCertificaitonNet1":"EducacionIT",
        "certificaitonHolograma":"hologram",
        "bodyCertificaitonHolograma":"Industrial Technical Institute 'San Judas Tadeo'",
        "certificaitonSecundaria":"Bachelor of Goods and Services",
        "bodyCertificaitonSecundaria":"Industrial Technical Institute 'San Judas Tadeo'",
        "certificaitonJs1":"Javascript Advanced Front-End Developer",
        "bodyCertificaitonJs1":"EducacionIT",
        "certificaitonSql1":"Fundamentals of Programming with SQL Server 2017",
        "bodyCertificaitonSql1":"EducacionIT",
        "certificaitonSql2":"SQL Queries in Microsoft SQL server certification 70-61",
        "bodyCertificaitonSql2":"Udemy",
        "certificaitonHtml1":"HTML5: Web Fundamentals",
        "bodyCertificaitonHtml1":"EducacionIT",
        "certificaitonNet2":"Introduction to Programming with C# .NET",
        "bodyCertificaitonNet2":"EducacionIT",
        "certificaitonHtml2":"Introduction to Programming with C# .NET",
        "bodyCertificaitonHtml2":"EducacionIT",
        "certificaitonReact1":"Reactjs",
        "bodyCertificaitonReact1":"EducacionIT",
        "certificaitonReact2":"React - The Complete Guide: Hooks Context Redux MERN +15 Apps",
        "certificaitonGoogle":"Google Analytics for Beginners",
        "bodyCertificaitonGoogle":"Google Analytics Academy",
        "certificaitonUTN":"Web design",
        "bodyCertificaitonUTN":"National Technological University",
        "certificaitonCertiprof":"CertiProf",
        "bodyCertificaitonCertiprof":"Scrum Foundation Professional Certificate",
        "footerTitleDescription": "Description",
        "footerBodyDescription" : "I am a technology enthusiast who is constantly learning and knowledge",
        "footerTitleStackTecnologico": "Technical Stack",
        "footerTitleFortaleza": "Strength",
        "footerBodyFortaleza1": "Implementation of good practices",
        "footerBodyFortaleza2": "Repair of computer systems",
        "footerBodyFortaleza3": "Management and use of servers",
        "footerBodyFortaleza4": "Comfort developing back end and front end",
        "footerBodyFortaleza5": "Excellent technical problem solving.",
        "footerTitleContacto": "Contact",
        "projects": 
        [
            {
                "projectTitle":"Client Finder",
                "projectSubTitleUsser":"Description for the user",
                "projectSubTitleTec":"Description of the technology",
                "projectDescripUsuario":"In this application you can use an advanced search engine in which we can perform general customer searches, or we can search by type of information, be it name, address, email. We can also filter by checked customers.",
                "projectDescripTec":"We can search for clients using search algorithms and we can group search filters to find the client you are looking for"
            },
            {
                "projectTitle":"Triviador",
                "projectSubTitleUsser":"Description for the user",
                "projectSubTitleTec":"Description of the technology",
                "projectDescripUsuario":"in this web application the user can register their name and choose a type of trivia to answer ten multiple choice questions. They will get their score and how long it takes to do the trivia. At the end they will be able to access a table with the top 10 best scores.",
                "projectDescripTec":"in this web application that uses firebase I was able to manage user records with information registered in the application. Users can enter with their name and obtain trivia and random genres from a database. This application is built with EcmaScript stores the score and the duration that the user had to finish the trivia of the genre they chose."
            },
            {
                "projectTitle":"React weather",
                "projectSubTitleUsser":"Description for the user",
                "projectSubTitleTec":"Description of the technology",
                "projectDescripUsuario":"Loading the information to the form, it will show the weather of the chosen area showing the result in a user-friendly way.",
                "projectDescripTec":"Consult a weather api, save the information in the state and display it in a component that can be parameterized by the api's response."
            },
            {
                "projectTitle":"Found Image",
                "projectSubTitleUsser":"Description for the user",
                "projectSubTitleTec":"Description of the technology",
                "projectDescripUsuario":"The user will be able to see products and access their description, they will also be able to search for this product in a protected way, otherwise the content of the products page and the search engine are hidden and cannot be accessible. ",
                "projectDescripTec":"In this project, JWT (json web token) is used to validate the user's 'session' to show or not the content."
            },
            {
                "projectTitle":"Store Front-end",
                "projectSubTitleUsser":"Description for the user",
                "projectSubTitleTec":"Description of the technology",
                "projectDescripUsuario":"The user will be able to see products and access their description, they will also be able to search for this product in a protected way, otherwise the content of the products page and the search engine are hidden and cannot be accessible. ",
                "projectDescripTec":"In this project, JWT (json web token) is used to validate the user's 'session' to show or not the content."
            },
            {
                "projectTitle":"Veterinary Shift Generator",
                "projectSubTitleUsser":"Description for the user",
                "projectSubTitleTec":"Description of the technology",
                "projectDescripUsuario":"The user can generate shifts for a veterinarian and if the application closes involuntarily, the information will persist. The user has the option to permanently delete the shift.",
                "projectDescripTec":"With the help of the state of react and hooks with props, this web application was obtained that saves information from a form to register shifts of a veterinarian, if the page is updated or closed this is saved in cache and when it comes back enter, the information can be accessed again."
       
            },
            {
                "projectTitle":"Playlist Player",
                "projectSubTitleUsser":"Description for the user",
                "projectSubTitleTec":"Description of the technology",
                "projectDescripUsuario":"The user can use the project to play five different songs both from the playlist and from the player.",
                "projectDescripTec":"In this project, we have a song list player, through events we can select different songs within the playlist."
        
            },
            {
                "projectTitle":"Popular Phrases",
                "projectSubTitleUsser":"Description for the user",
                "projectSubTitleTec":"Description of the technology",
                "projectDescripUsuario":"For Breaking bad fans, in this web application, phrases of various characters are shown. And just by pressing a button, you get a new phrase",
                "projectDescripTec":"With an api, a timer and a refresh we managed to make a web application in which the phrase is updated after 10-15 seconds through an animation."
        
            },
            {
                "projectTitle":"Shipping reservation",
                "projectSubTitleUsser":"Description for the user",
                "projectSubTitleTec":"Description of the technology",
                "projectDescripUsuario":"We can manage reservations at different times and we have the option to cancel or register a reservation.",
                "projectDescripTec":"Within the application we create the schedules every 30 minutes and then using stack-type vectors we run out of reserves."
        
            },
            {
                "projectTitle":"Song lyrics search engine",
                "projectSubTitleUsser":"Description for the user",
                "projectSubTitleTec":"Description of the technology",
                "projectDescripUsuario": "The user completing the form will be able to access a hidden section of the page with the result of the search he did.",
                "projectDescripTec":"Description of the technology It uses two apis, one to consult the lyrics and another that is an image search engine that is attributed two values: the artist and the song, then it provides an image of the artist and the lyrics of the searched song."
            },
            {
                "projectTitle":"Word Transformer in CamelCase",
                "projectSubTitleUsser":"Description for the user",
                "projectSubTitleTec":"Description of the technology",
                "projectDescripUsuario":"The user will be able to upload words or sentences and convert them to CamelCase.",
                "projectDescripTec":"With the hock technology and javascrpit's own methods I was able to filter the spaces of the entered string and capitalize the character following the white space."
            },
            {
                "projectTitle":"Automatic Budgeter",
                "projectSubTitleUsser":"Description for the user",
                "projectSubTitleTec":"Description of the technology",
                "projectDescripUsuario":"With the hock technology and javascrpit's own methods I was able to filter the spaces in the entered string and capitalize the character following the blank space.",
                "projectDescripTec":"A value of the total budget is defined that is saved in the state. Then with new values, which are loaded by the user, they are subtracted from the total budget and generate a list of expenses. In the case of exceeding the budget Total will be reported by the web app as below the remaining budget."
              
            }
        ]
    }
}